20150527-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>20150527-notes</title>
<!-- 2015-06-24 Mi 16:59 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
</head>
<body>
<div id="content">
<h1 class="title">20150527-notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. Lefteris's old post on Emacs+Android</a></li>
<li><a href="#sec-2">2. Starting a new project</a></li>
</ul>
</div>
</div>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a href="http://blog.refu.co/?p=1242">Lefteris's old post on Emacs+Android</a></h2>
<div class="outline-text-2" id="text-1">
<p>
Current version of the SDK is 24.2
</p>

<p>
His post mentions downloading a tarball, then uses unzip :)
</p>

<p>
mkdir -p ~/opt
cd ~/opt
wget <a href="http://dl.google.com/android/android-sdk_r24.2-linux.tgz">http://dl.google.com/android/android-sdk_r24.2-linux.tgz</a>
tar xvzf android-sdk<sub>r24</sub>.2-linux.tgz
</p>

<p>
This creates ~/opt/android-sdk-linux, which we'll just leave as is.
</p>

<p>
Get android-mode
</p>

<p>
(package-refresh-contents)
(package-install 'android-mode)
</p>

<p>
(custom-set-variables '(android-mode-sdk-dir "~/opt/android-sdk-linux"))
</p>

<p>
export PATH=$PATH:~/opt/android-sdk-linux/tools
</p>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Starting a new project</h2>
<div class="outline-text-2" id="text-2">
<p>
TARGET<sub>PATH</sub>="my<sub>first</sub><sub>app</sub>"
PROJECT<sub>NAME</sub>="My First App"
COMPANY<sub>DOMAIN</sub>="com.mycompany"
PACKAGE<sub>NAME</sub>="com.mycompany.my<sub>first</sub><sub>app</sub>"
</p>

<p>
android create project
&#x2013;path "$TARGET<sub>PATH</sub>"
&#x2013;name "$PROJECT<sub>NAME</sub>"
&#x2013;package "$PACKAGE<sub>NAME</sub>"
&#x2013;target 1
</p>

<p>
Which API to target, use "android list targets" to see the options
</p>

<p>
&#x2013;activity "Test Activity"
</p>

<p>
android create project \
&#x2013;path ~/tmp/my<sub>project</sub><sub>2</sub> \
&#x2013;name "SinoLogic1" \
&#x2013;package "com.sinologic.sinologic1" \
&#x2013;target android-22 \
&#x2013;activity "Sinoactive"
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2015-06-24 Mi 16:59</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.0.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.7c)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
